app/Http/Controllers/Auth/LoginController.php

    public function logout(Request $request)
    {
        $user = auth()->user();

        $userLoginHistoryMixin = new UserLoginHistoryMixin();
        $userLoginHistoryMixin->storeUserLogoutHistory($user->id);

        $this->guard()->logout();

        $request->session()->invalidate();

        $request->session()->regenerateToken();

        if (!empty($user) and $user->logged_count > 0) {

            $user->update([
                'logged_count' => $user->logged_count - 1
            ]);
---
update `users` set `logged_count` = 0 where `id` = 1016

            return $this->sendMaximumActiveSessionResponse();
        }

        $user->update([
            'logged_count' => (int)$user->logged_count + 1
        ]);
---
update `users` set `logged_count` = 1 where `id` = 1057