app/PaymentChannels/Drivers/Sepay/Channel.php

    public function verify(Request $request)
    {
        $token = $request->header('Authorization');
        $token = Str::replace('Apikey ', '', $token);
        if ($token != $this->apiToken) {
            throw new \Exception('Invalid Token');
        }

        $data = $request->all();
        $content = $data['content'];
        preg_match('/HUNGAI(\w*)/', $content, $matches);
        $code = $matches[1];
        $order = Order::query()->where('reference_id', $code)->first();
---
select * from `orders` where `reference_id` = '' limit 1