app/Http/Controllers/Panel/WebinarController.php

select * from `sales` where `seller_id` = 1016 and `type` = 'webinar' and `webinar_id` is not null and `refund_at` is null
select * from `webinars` where `webinars`.`id` in (1995, 2024, 2025)
---
    private function makeMyClassAndInvitationsData($query, $user, $request)
    {
        $webinarHours = deepClone($query)->sum('duration');

        $onlyNotConducted = $request->get('not_conducted');
        if (!empty($onlyNotConducted)) {
            $query->where('status', 'active')
                ->where('start_date', '>', time());
        }

        $query->with([
            'reviews' => function ($query) {
                $query->where('status', 'active');
            },
            'category',
            'teacher'
        ])->orderBy('updated_at', 'desc');

        $webinarsCount = $query->count();

        $webinars = $query->paginate(10);

        $webinarSales = Sale::where('seller_id', $user->id)
            ->where('type', 'webinar')
            ->whereNotNull('webinar_id')
            ->whereNull('refund_at')
            ->with('webinar')
            ->get();

select `id` from `gifts` where `webinar_id` = 2027 and `status` = 'active' and (`date` is null or `date` < 1734192735) and exists (select * from `sales` where `gifts`.`id` = `sales`.`gift_id`)
select * from `sales` where (`webinar_id` = 2027 or 0 = 1) and `refund_at` is null
---
        }

        foreach ($webinars as $webinar) {
            $giftsIds = Gift::query()->where('webinar_id', $webinar->id)
                ->where('status', 'active')
                ->where(function ($query) {
                    $query->whereNull('date');
                    $query->orWhere('date', '<', time());
                })
                ->whereHas('sale')
                ->pluck('id')
                ->toArray();

            $sales = Sale::query()
                ->where(function ($query) use ($webinar, $giftsIds) {
                    $query->where('webinar_id', $webinar->id);
                    $query->orWhereIn('gift_id', $giftsIds);
                })
                ->whereNull('refund_at')
                ->get();

select * from `categories` where `parent_id` is null
---
                'tags',
            ]);

            $categories = Category::where('parent_id', null)
                ->with('subCategories')
                ->get();

select * from `categories` where `id` = '606' limit 1
---
            $webinarCategoryFilters = !empty($webinar->category) ? $webinar->category->filters : [];

            if (empty($webinar->category) and !empty($request->old('category_id'))) {
                $category = Category::where('id', $request->old('category_id'))->first();

select * from `webinars` where `id` = '2030' and ((`creator_id` = 1016 or `teacher_id` = 1016) or exists (select * from `webinar_partner_teacher` where `webinars`.`id` = `webinar_partner_teacher`.`webinar_id` and `teacher_id` = 1016)) limit 1
---
    public function update(Request $request, $id)
    {
        $this->authorize("panel_webinars_create");

        $user = auth()->user();

        if (!$user->isTeacher() and !$user->isOrganization()) {
            abort(404);
        }

        $rules = [];
        $data = $request->all();
        $currentStep = $data['current_step'];
        $getStep = $data['get_step'];
        $getNextStep = (!empty($data['get_next']) and $data['get_next'] == 1);
        $isDraft = (!empty($data['draft']) and $data['draft'] == 1);

        $webinar = Webinar::where('id', $id)
            ->where(function ($query) use ($user) {
                $query->where(function ($query) use ($user) {
                    $query->where('creator_id', $user->id)
                        ->orWhere('teacher_id', $user->id);
                });

                $query->orWhereHas('webinarPartnerTeacher', function ($query) use ($user) {
                    $query->where('teacher_id', $user->id);
                });
            })->first();

update `webinars` set `subscribe` = 0, `updated_at` = 1734766416 where `id` = 2030
---
            $data['teacher_id'] = $user->id;
        }

        $webinar->update($data);

select `id` from `gifts` where `email` = 'Ricardodave09@hotmail.comda' and `status` = 'active' and `product_id` is null and (`date` is null or `date` < 1734365605) and exists (select * from `sales` where `gifts`.`id` = `sales`.`gift_id`)
---
    public function purchases(Request $request)
    {
        $this->authorize("panel_webinars_my_purchases");

        $user = auth()->user();

        $giftsIds = Gift::query()->where('email', $user->email)
            ->where('status', 'active')
            ->whereNull('product_id')
            ->where(function ($query) {
                $query->whereNull('date');
                $query->orWhere('date', '<', time());
            })
            ->whereHas('sale')
            ->pluck('id')
            ->toArray();