app/Http/Controllers/Web/PaymentController.php

select * from `orders` where `reference_id` = '4AUWJNYQXM' limit 1
---
    public function getOrderByCode($code)
    {
        $order = Order::query()->where('reference_id', $code)->firstOrFail();

select * from `orders` where `reference_id` = '4AUWJNYQXM' limit 1
select * from `payment_channels` where `id` = '43' limit 1
---
    public function bankTransfer($code, $chanelId, Request $request)
    {
        $order = Order::query()->where('reference_id', $code)->firstOrFail();
        $paymentChanel = PaymentChannel::query()->where('id', $chanelId)->firstOrFail();

select * from `payment_channels` where `id` = '43' and `status` = 'active' limit 1
---
    public function paymentVerify2(Request $request, $chanelId)
    {
        $paymentChannel = PaymentChannel::where('id', $chanelId)
            ->where('status', 'active')
            ->first();