app/Http/Controllers/Web/WebinarController.php

select * from `favorites` where `webinar_id` = 2027 and `user_id` = 1016 limit 1
---
        $isFavorite = false;

        if (!empty($user)) {
            $isFavorite = Favorite::where('webinar_id', $course->id)
                ->where('user_id', $user->id)
                ->first();

select * from `advertising_banners` where `published` = 1 and `position` in ('course', 'course_sidebar')
---
            $webinarContentCount += $course->assignments->count();
        }

        $advertisingBanners = AdvertisingBanner::where('published', true)
            ->whereIn('position', ['course', 'course_sidebar'])
            ->get();

select * from `quizzes` where `quizzes`.`id` = 99 limit 1
---

        $textLessonsWithoutChapter = $course->textLessons->whereNull('chapter_id');

        $quizzes = $course->quizzes->whereNull('chapter_id');

select * from `files` where `id` = '99' limit 1
select `id`, `webinar_id`, `file_type` from `files` where `files`.`webinar_id` in (2027) and `status` = 'active' order by `order` asc
---
    public function getFilePath(Request $request)
    {
        $this->validate($request, [
            'file_id' => 'required'
        ]);

        $file_id = $request->get('file_id');

        $file = File::where('id', $file_id)
            ->first();

        if (!empty($file)) {
            $webinar = Webinar::where('id', $file->webinar_id)
                ->where('status', 'active')
                ->with([
                    'files' => function ($query) {
                        $query->select('id', 'webinar_id', 'file_type')
                            ->where('status', 'active')
                            ->orderBy('order', 'asc');
                    }
                ])
                ->first();